let newthings = [
  {
    id: 1,
    img: "img/1.png",
    title: "სკანდალი ჩოგბურთში - რუსი იანა სიზიკოვა საფრანგეთში დააკავეს",
    desc: "ჟურნალისტი კრის ბრიუსარი მიიჩნევს, რომ სკოტი პიპენმა მაიკლ ჯორდანის მიმართ უპატივცემულობა გამოიჩინა. პიპენის ავტობიოგრაფიული წიგნი 2021 წლის ნოემბრიდა...",
    caption: "3 საათის წინ",
  },
  {
    id: 2,
    img: "img/Rectangle19.png",
    title: "კოუტინიო ვალის სანაცვლოდ - ბარსელონას უცნაური სქემა",
    desc: "ჟურნალისტი კრის ბრიუსარი მიიჩნევს, რომ სკოტი პიპენმა მაიკლ ჯორდანის მიმართ უპატივცემულობა გამოიჩინა. პიპენის ავტობიოგრაფიული წიგნი 2021 წლის ნოემბრიდა...",
    caption: "3 საათის წინ",
  },
  {
    id: 3,
    img: "img/Rectangle11.png",
    title: "კოუტინიო ვალის სანაცვლოდ - ბარსელონას უცნაური სქემა",
    desc: "ჟურნალისტი კრის ბრიუსარი მიიჩნევს, რომ სკოტი პიპენმა მაიკლ ჯორდანის მიმართ უპატივცემულობა გამოიჩინა. პიპენის ავტობიოგრაფიული წიგნი 2021 წლის ნოემბრიდა...",
    caption: "3 საათის წინ",
  },
  {
    id: 4,
    img: "img/Rectangle12.png",
    title: "კოუტინიო ვალის სანაცვლოდ - ბარსელონას უცნაური სქემა",
    desc: "ჟურნალისტი კრის ბრიუსარი მიიჩნევს, რომ სკოტი პიპენმა მაიკლ ჯორდანის მიმართ უპატივცემულობა გამოიჩინა. პიპენის ავტობიოგრაფიული წიგნი 2021 წლის ნოემბრიდა...",
    caption: "3 საათის წინ",
  },
  {
    id: 5,
    img: "img/Rectangle13.png",
    title: "კოუტინიო ვალის სანაცვლოდ - ბარსელონას უცნაური სქემა",
    desc: "ჟურნალისტი კრის ბრიუსარი მიიჩნევს, რომ სკოტი პიპენმა მაიკლ ჯორდანის მიმართ უპატივცემულობა გამოიჩინა. პიპენის ავტობიოგრაფიული წიგნი 2021 წლის ნოემბრიდა...",
    caption: "3 საათის წინ",
  },
  {
    id: 6,
    img: "img/Rectangle14.png",
    title: "კოუტინიო ვალის სანაცვლოდ - ბარსელონას უცნაური სქემა",
    desc: "ჟურნალისტი კრის ბრიუსარი მიიჩნევს, რომ სკოტი პიპენმა მაიკლ ჯორდანის მიმართ უპატივცემულობა გამოიჩინა. პიპენის ავტობიოგრაფიული წიგნი 2021 წლის ნოემბრიდა...",
    caption: "3 საათის წინ",
  },
  {
    id: 7,
    img: "img/Rectangle15.png",
    title: "კოუტინიო ვალის სანაცვლოდ - ბარსელონას უცნაური სქემა",
    desc: "ჟურნალისტი კრის ბრიუსარი მიიჩნევს, რომ სკოტი პიპენმა მაიკლ ჯორდანის მიმართ უპატივცემულობა გამოიჩინა. პიპენის ავტობიოგრაფიული წიგნი 2021 წლის ნოემბრიდა...",
    caption: "3 საათის წინ",
  },
  {
    id: 5,
    img: "img/Rectangle16.png",
    title: "კოუტინიო ვალის სანაცვლოდ - ბარსელონას უცნაური სქემა",
    desc: "ჟურნალისტი კრის ბრიუსარი მიიჩნევს, რომ სკოტი პიპენმა მაიკლ ჯორდანის მიმართ უპატივცემულობა გამოიჩინა. პიპენის ავტობიოგრაფიული წიგნი 2021 წლის ნოემბრიდა...",
    caption: "3 საათის წინ",
  },
  {
    id: 6,
    img: "img/Rectangle17.png",
    title: "კოუტინიო ვალის სანაცვლოდ - ბარსელონას უცნაური სქემა",
    desc: "ჟურნალისტი კრის ბრიუსარი მიიჩნევს, რომ სკოტი პიპენმა მაიკლ ჯორდანის მიმართ უპატივცემულობა გამოიჩინა. პიპენის ავტობიოგრაფიული წიგნი 2021 წლის ნოემბრიდა...",
    caption: "3 საათის წინ",
  },
  {
    id: 7,
    img: "img/Rectangle18.png",
    title: "კოუტინიო ვალის სანაცვლოდ - ბარსელონას უცნაური სქემა",
    desc: "ჟურნალისტი კრის ბრიუსარი მიიჩნევს, რომ სკოტი პიპენმა მაიკლ ჯორდანის მიმართ უპატივცემულობა გამოიჩინა. პიპენის ავტობიოგრაფიული წიგნი 2021 წლის ნოემბრიდა...",
    caption: "3 საათის წინ",
  },
];

document.getElementById("all").innerHTML = newthings
  .map(
    (newthing) => ` <a class="flex items-center mt-8 cursor-pointer">
    <img class="h-38 max-w-sm rounded-4 md:w-60 xxs:w-32" 
    src=${newthing.img}
  />
<div class="h-auto w-96 grid items-center justify-center ml-6 md:w-80 sm:w-60 videoResSm:w-auto videoResSm:h-auto gap-2 xxs:w-full xxs:h-auto">
  <h2 class="text-black font-semibold text-base xxs:w-auto">${newthing.title}</h2>
  <h2 class="desc videoResSm:block xxs:hidden">${newthing.desc}</h2>
  <div class="flex items-center">
    <img class="mr-1.5 " src="img/Clock.png"/>
    <h2 class="caption" style="color: #B2B2B2">${newthing.caption}</h2>
  </div>
</div>
</a>`
  )
  .join("");
